<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Fkab;

class fkabids extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        /* Fkab::create( [
            'id'=>'1',
            'name'=>'  التأخير المتكرر  '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'2',
            'name'=>' غياب غير مبرر'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'3',
            'name'=>' عدم إرتداء الملابس المهنية'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'4',
            'name'=>' التخلي عن البطاقة المهنية'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'5',
            'name'=>' عدم إتباع تعليمات  المسؤول المباشر'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'6',
            'name'=>' عدم المصادقة على التذاكر'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'7',
            'name'=>' عدم إحترام المسؤول المباشر'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'8',
            'name'=>' عدم إحترام زملاء العمل'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'9',
            'name'=>' مغادرة أماكن العمل دون ترخيص مسبق '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'10',
            'name'=>' انعدام ورقة الطريق'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'11',
            'name'=>' دفع متأخر للمحصول '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'12',
            'name'=>' التأخر في بيع التذاكر'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'13',
            'name'=>' رفض الخضوع لعملية المراقبة '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'14',
            'name'=>' رفض دون سبب العمل الإضافي , استمرارية الخدمة أو التكوين المهني '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'15',
            'name'=>' الإهانة المرتكبة ضد شخص أو زملاء العمل أثناء ساعات العمل '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'16',
            'name'=>' ترك المنصب خلال أوقات العمل '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'17',
            'name'=>' فائض أو نقص في الصندوق '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'18',
            'name'=>' رفض إصعاد أو إنزال الركاب في نقطة التوقف '
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'19',
            'name'=>' رفض إرتداء الزي المهني'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'20',
            'name'=>' أي عمل يتسبب في جمع العمال لأغراض سياسية'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'21',
            'name'=>' المشاركة في عمل جماعي بحكم انتهاك القوانين التنظيمية أو الاتفاقية'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'22',
            'name'=>' عدم إحترام التعليمات ذات صلة بالإلتزامات المهنية دون سبب'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'23',
            'name'=>' التعدي و الضرب و العنف ضد أي شخص داخل أماكن العمل'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'24',
            'name'=>' جمع حاجيات أو أموال داخل أماكن العمل خارج إجراءات قانونية'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'25',
            'name'=>' السرقة و الإختلاس'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'26',
            'name'=>' التصريح الكاذب أو التزويرأو إستعمال المزور'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'27',
            'name'=>'  تناول الكحول داخل مكان العمل'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'28',
            'name'=>' إعادة بيع التذاكر المستعملة'
            ] );
            
            
                        
            Fkab::create( [
            'id'=>'29',
            'name'=>' قبض ثمن التذاكر بدون تسليمها'
            ] );
            */

            Fkab::create( [
                'id'=>'1',
                'name'=>'التأخير المتكرر.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'2',
                'name'=>'الوقوف في الأماكن المحددة أو الوضعية الغير مناسبة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'3',
                'name'=>'عدم إرتداء الملابس المهنية ووسائل الحماية.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'4',
                'name'=>'عدم إتباع التعليمات.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'5',
                'name'=>'تجمع العمال في الأروقة والحظيرة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'6',
                'name'=>'عدم احترام المسؤول المباشر أو زملاء العمل.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'7',
                'name'=>'مغادرة أماكن العمل دون ترخيص مسبق.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'8',
                'name'=>'إنعدام الوثائق أو الملحقات " ورقة الطريق، الرسم البياني".',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'9',
                'name'=>'إهمال المراجعة المبدئية للمركبة قبل استعمالها من قبل السائق.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'10',
                'name'=>'عدم إحضار التذاكر .',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'11',
                'name'=>'الوقوف أو التوقف للحافلة في غير الأماكن الغير مخصصة دون سبب.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'12',
                'name'=>'عدم احترام إشارة المراقبين من طرف السائق.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'13',
                'name'=>'التخلي عن البطاقة المهنية ',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'14',
                'name'=>'حضور غير مصرح لأشخاص ومركبات أجنبية داخل مكان العمل بالمؤسسة. ',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'15',
                'name'=>'رفض التأشير أو الغش فيه.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'16',
                'name'=>'خطأ في عد الحقيبة (مسؤولية المراقب).',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'17',
                'name'=>'دفع متأخر للمحصول.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'18',
                'name'=>'رفض القابض الخضوع لعملية المراقبة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'19',
                'name'=>'الحضور الغير مصرح للعامل خارج أوقات العمل داخل المؤسسة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'20',
                'name'=>'التغيب عن منصب العمل بدون تبرير.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'21',
                'name'=>'عدم الالتحاق بمنصب العمل بعد الراحة بدون سبب مقنع.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'22',
                'name'=>'تواجد المراقبين والمراقبين الرئيسيين والمكلفين بالمراقبة بالمحطات أثناء أوقات العمل دون ترخيص.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'23',
                'name'=>'خروج الحافلات ودخولها إلى الحظيرة دون قابض وبدون ترخيص الا في الحالات الاستثنائية فقط.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'24',
                'name'=>'تضييع الوقت والتسبب في تعطيل العمل.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'25',
                'name'=>'عدم المصادقة الإلكترونية على البطاقات و التذاكر.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'26',
                'name'=>'التأخر في قبض ثمن التذاكر.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'27',
                'name'=>'تعليق منشورات أو أي وثائق في أماكن العمل و الحافلات و المحطات دون ترخيص و في غير الأماكن المحددة و المتفق عليها.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'28',
                'name'=>'عدم استعمال العمال للتطبيقات والبرامج المتعلقة بالرقمنة في الأعمال اليومية للمؤسسة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'29',
                'name'=>'عدم المحافظة على الأجهزة ووسائل العمل.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'30',
                'name'=>'التدخين في أماكن العمل و في غير الأماكن المرخص بها.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'31',
                'name'=>'الافراط في السرعة و/أو المناورة الخطيرة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'32',
                'name'=>'عدم اخذ إجراءات اللازمة اثناء سياقة المركبة مما يلحق أضرارا بها.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'33',
                'name'=>'عدم احترام السائق للمسلك عند بداية ونهاية  المداومة.',
                'type'=>'1'
                ] );
                            
                Fkab::create( [
                'id'=>'34',
                'name'=>'تكرار الأخطاء من الدرجة الأولى.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'35',
                'name'=>'رفض آداء الساعات الإضافية واستمرارية الخدمة أو الاستجابة للدورات التكوينية.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'36',
                'name'=>'توجيه اهانات الى عمال او مسافرين اثناء ساعات العمل',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'37',
                'name'=>'عدم تنفيذ مخطط الاستغلال.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'38',
                'name'=>'ادارة و تشغيل المركبات دون تصريح.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'39',
                'name'=>'كل تصرف من شأنه الاضرار بالمركبة.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'40',
                'name'=>'ترك المنصب خلال أوقات العمل.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'41',
                'name'=>'عدم التصريح بالحوادث في الآجال المحددة.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'42',
                'name'=>'فائض أو نقص في الصندوق.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'43',
                'name'=>'عدم احترام وتطبيق قواعد النظافة والأمن التي قد تلحق أضرار بالأشخاص والممتلكات.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'44',
                'name'=>'تغيير في خطة السير أو تغير المسار دون تصريح.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'45',
                'name'=>'رفض اصعاد أو إنزال الركاب في نقطة التوقف.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'46',
                'name'=>'رفض ارتداء الزي المناسب.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'47',
                'name'=>'استخدام سلع ووسائل المؤسسة لأغراض شخصية.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'48',
                'name'=>'عدم تسليم الحاجيات، الأمتعة الضائعة للمسافرين التي يجدها العمال بالمحطات أو الحافلات عند نهاية الخدمة اليومية للمكلفين بالاستلام.',
                'type'=>'2'
                ] );
                            
                Fkab::create( [
                'id'=>'49',
                'name'=>'إذا قام بأعمال عنف.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'50',
                'name'=>'إذا تناول الكحول أو المخدرات داخل أماكن العمل',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'51',
                'name'=>'تكرار الأخطاء من الدرجة الثانية',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'52',
                'name'=>'أي عمل يتسبب في جمع العمال لأغراض سياسية.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'53',
                'name'=>'عدم احترام التعليمات ذات صلة بالالتزامات المهنية دون سبب و الذي يؤدي الى الحاق أضرار بالمؤسسة.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'54',
                'name'=>'جمع حاجيات أو أموال مهما كانت طبيعتها داخل أماكن العمل خارج إجراءات قانونية.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'55',
                'name'=>'ارتكاب جرائم او أعمال يعاقب عليها القانون الجزائي داخل مكان العمل.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'56',
                'name'=>'تقديم شهادة كاذبة أو تزوير.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'57',
                'name'=>'التصرفات المشينة التي من شأنها ان تحدث ضررا لسمعة المؤسسة و منتسبيها.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'58',
                'name'=>'كل دفع من أي نوع غير مسموح به وليس له أي علاقة بالمؤسسة.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'59',
                'name'=>'السرقة والاختلاس.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'60',
                'name'=>'تخريب عتاد المؤسسة عمدا.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'61',
                'name'=>'قبض ثمن التذكرة دون تسليمها.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'62',
                'name'=>'تسليم تذاكر مستعملة أو الغش في تذاكر النقل أو سعرها.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'63',
                'name'=>'الحصول على هبات غير مبررة.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'64',
                'name'=>'الاتفاقات غير المشروعة مهما كان نوعها مع المتعاملين أو المنافسين للمؤسسة.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'65',
                'name'=>'العمل لدى منافسي المؤسسة خارج أوقات ساعات العمل أو في العطل السنوية أو التعويضية أو العطل المرضية.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'66',
                'name'=>'الجمع بين وظيفتين داخل وخارج المؤسسة.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'67',
                'name'=>'التحريض و إثارة الفوضى و خلق جو غير مناسب داخل أو بجانب أماكن العمل و المحطات و بالحافلات.',
                'type'=>'3'
                ] );
                            
                Fkab::create( [
                'id'=>'68',
                'name'=>'المطالب غير المشروعة والسب  و الشتم و التهديد و المناورة و الاعتداء و أي نوع من أنواع العنف التي تهدف إلى المساس بحرية العمل و بوسائله.',
                'type'=>'3'
                ] );
    }
}